# Посортувати всі вхідні параметри програми в масиві

# Ви маєте дописати логіку сортування масиву у спадному порядку.

class Calculator
    def sort_incoming_args

    # при запуску скрипту з консолі, аргументи які йдуть після імені файлу попадають в масив ARGV
    puts "Отримані аргументи"
    puts ARGV

    # тут його слід скопіювати в новий масив
    a = Array.new(ARGV)

    # тут його слід посортувати в спадаючому напрямку

    #перевірка чи введено якісь аргументи
    unless(a[0].class == NilClass)
      #перевірка першого елемента масиву якщо він дійсний то сортуємо масив як масив дійсних чисел
      #інакше сортуємо масив як масив рядків
      if(Float(a[0]) != nil rescue false)
        a = a.sort {|a, b| b.to_f <=> a.to_f}
      else
        a = a.sort {|a, b| b <=> a}
      end
    else
      puts "дані не введено"
    end

    # тут його слід вивести
    puts "Посортовані вхідні аргументи"
    puts a

  end
end
